app/assets/xml_templates/place_bid_with_purchase_profile.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <PlaceBidWithPurchaseProfile xmlns="GdAuctionsBiddingWSAPI_v2">
      <domainName>DOMAIN_NAME</domainName>
      <bidAmount>BID_AMOUNT</bidAmount>
      <bidComments>BID_COMMENTS</bidComments>
      <useMyPurchaseProfile>USE_MY_PURCHASE_PROFILE</useMyPurchaseProfile>
      <acceptUTOS>ACCEPT_UTOS</acceptUTOS>
      <acceptAMA>ACCEPT_AMA</acceptAMA>
      <acceptDNRA>ACCEPT_DNRA</acceptDNRA>
    </PlaceBidWithPurchaseProfile>
  </soap12:Body>
</soap12:Envelope>
